* Configuration 					      :ignoreheading:

#+TITLE: Software for Structural Equation Modeling
#+AUTHOR: Klaus Kähler Holst
#+DATE: \today
# +email: k.k.holst@biostat.ku.dk
# +LaTeX_HEADER: \institute{Department of Biostatistics, University of Copenhagen}
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS: LaTeX:t 
# +startup: beamer
#+LaTeX_CLASS: plain
#+LaTeX_CLASS_OPTIONS: [a4paper,12pt] 
#+LaTeX_HEADER: \RequirePackage{etex}
#+LaTeX_HEADER: \usepackage[utf8]{inputenc}
#+LaTeX_HEADER: \RequirePackage[l2tabu,orthodox]{nag}% Old habits die hard. All the
#+LaTeX_HEADER: \usepackage{fixltx2e}
# +LaTeX_HEADER: \usepackage[all,error]{onlyamsmath}  % Error on deprecated math commands like $$ $$.
#+LaTeX_HEADER: \usepackage[strict=true]{csquotes}
#+LaTeX_HEADER: \newcommand{\usetheme}[1]{}
#+LaTeX_HEADER: \textheight=9in \textwidth=6.5in \topmargin=-.50in \evensidemargin=0in \oddsidemargin=0in
#+LaTeX_HEADER: \usepackage{graphicx} 
#+LaTeX_HEADER: \usepackage[hidelinks,colorlinks,linkcolor={blue!50!black},urlcolor={blue!50!black},citecolor={blue!50!black}]{hyperref}
#+LaTeX_HEADER: \usepackage{listings} 
#+LaTeX_HEADER: \usepackage[usenames]{xcolor} 
#+LaTeX_HEADER: \setlength{\unitlength}{.6pt}
#+LaTeX_HEADER: \newcommand{\etal}{et al.}
#+LaTeX_HEADER: \lstdefinestyle{R}{language=R,alsoletter={.},morekeywords={lvm}}
#+LaTeX_HEADER: \lstdefinestyle{stata}{language=R}
#+LaTeX_HEADER: \lstdefinestyle{Rplus}{language=R,alsoletter={.},
#+LaTeX_HEADER: morekeywords={plot.lvm,latent,regression,lvm,sim,set.seed,with,lava.options,
#+LaTeX_HEADER: geeglm,lmline,lmer,estimate,xyplot}} % BEGIN_SRC R,style=Rplus
#+LATEX_HEADER: \include{listings-stata}
#+LaTeX_HEADER: \usepackage{fancyvrb}
#+LATEX_HEADER: \DefineVerbatimEnvironment{verbatim}{Verbatim}{
#+LaTeX_HEADER:   frame=lines,fontsize=\footnotesize,%fontsize=\small,
#+LATEX_HEADER: formatcom = {\color[rgb]{0.3,0.3,0.3}}}
#+OPTIONS: toc:t

#+LaTeX: \clearpage

We will focus on a simple structural equation model shown in Figure ref:fig:lvma:
#+NAME: lvma
#+BEGIN_SRC R  :exports both :results output graphics :file figs/lvma.pdf :width 7 :height 7 :session *R*
library('lava')
m <- lvm(c(y1,y2,y3)~u,u~x,latent=~u)
labels(m) <- c(u=expression(eta))
plot(m)
#+END_SRC


#+BEGIN_CENTER
#+CAPTION: Measurement model label:fig:lvma
#+ATTR_LATEX: :width 6cm :options
#+RESULTS: lvma
[[file:figs/lvma.pdf]]

#+END_CENTER


Simulated data (notice long format):
#+BEGIN_SRC R :exports both :results output :session *R*
d <- subset(simulate(m,200,seed=1),select=manifest(m))
write.table(d,file="data.tab",row.names=FALSE,sep="\t")
head(d)
#+END_SRC

#+RESULTS:
:           y1         y2         y3           x
: 1 -2.0544296 -1.0185740 -0.3535348 -1.08690882
: 2 -0.1400152  1.3652148  1.5719963 -1.82608301
: 3  0.6879609  3.1101780  0.9205922  0.99528181
: 4  2.1256104  0.1994218  0.1394618 -0.01186178
: 5 -0.4067940 -3.0215373 -1.1525238 -0.59962839
: 6 -2.1351502  1.1829797 -1.6903393 -0.17794799

** =lava=

- https://github.com/kkholst/lava
- http://arxiv.org/abs/1206.3421

#+BEGIN_SRC R :exports both :results output :session *R*
library('lava')
m1 <- lvm()
regression(m1) <- c(y1,y2,y3)~u
regression(m1) <- u~x
covariance(m1) <- y2~y3
summary(estimate(m1,d))
#+END_SRC

#+RESULTS:
#+begin_example
Latent variables: u 
Number of rows in data=200
______________________________________________________________________
                    Estimate Std. Error  Z-value  P-value   std.xy
Measurements:                                                     
   y1~u              1.00000                               0.85222
   y2~u              1.01708    0.08215 12.38030   <1e-12  0.85678
   y3~u              1.01019    0.08186 12.34011   <1e-12  0.85468
Regressions:                                                      
   u~x               1.06038    0.09784 10.83740   <1e-12  0.71374
Intercepts:                                                       
   y1                0.00000                               0.00000
   y2                0.00607    0.09807  0.06192   0.9506  0.00323
   y3               -0.07678    0.09785 -0.78476   0.4326 -0.04101
   u                -0.06455    0.10434 -0.61865   0.5361 -0.04074
Residual Variances:                                               
   y1                0.94595    0.16358  5.78273           0.27373
   y2                0.94057    0.18872  4.98391           0.26593
   y2,y3            -0.16322    0.15290 -1.06746   0.2858 -0.04635
   y3                0.94504    0.18767  5.03559           0.26952
   u                 1.23128    0.18158  6.78091           0.49058
______________________________________________________________________
Estimator: gaussian 
______________________________________________________________________

 Number of observations = 200 
 BIC = 2074.994 
 AIC = 2026.628 
 log-Likelihood of model = -1002.314 

 log-Likelihood of saturated model = -1002.182 
 Chi-squared statistic: q = 0.2634556 , df = 1 
  P(Q>q) = 0.607756 

 RMSEA (90% CI): 0 (0;0.1498)
  P(RMSEA<0.05)=0.6880038
______________________________________________________________________
R-squared 
   y1    y2    y3     u 
0.726 0.734 0.730 0.509 
Variance explained by 'u' 
   y1    y2    y3 
0.726 0.734 0.730
#+end_example


** =lavaan=

- https://github.com/yrosseel/lavaan
- http://lavaan.ugent.be/

#+BEGIN_SRC R :exports both :results output :session *R*
library('lavaan')
modelb <- ' 
# latent variable definitions
u =~ y1 + y2 + y3
# regressions
u ~ x
## residual covvariance
y2 ~~y3
'
summary(lavaan::sem(modelb,data=d))
#+END_SRC

#+RESULTS:
#+begin_example
lavaan (0.5-20) converged normally after  21 iterations

  Number of observations                           200

  Estimator                                         ML
  Minimum Function Test Statistic                0.263
  Degrees of freedom                                 1
  P-value (Chi-square)                           0.608

Parameter Estimates:

  Information                                 Expected
  Standard Errors                             Standard

Latent Variables:
                   Estimate  Std.Err  Z-value  P(>|z|)
  u =~                                                
    y1                1.000                           
    y2                1.017    0.082   12.380    0.000
    y3                1.010    0.082   12.340    0.000

Regressions:
                   Estimate  Std.Err  Z-value  P(>|z|)
  u ~                                                 
    x                 1.060    0.098   10.837    0.000

Covariances:
                   Estimate  Std.Err  Z-value  P(>|z|)
  y2 ~~                                               
    y3               -0.163    0.153   -1.067    0.286

Variances:
                   Estimate  Std.Err  Z-value  P(>|z|)
    y1                0.946    0.164    5.783    0.000
    y2                0.941    0.189    4.984    0.000
    y3                0.945    0.188    5.036    0.000
    u                 1.231    0.182    6.781    0.000
#+end_example

** =sem=

- https://cran.r-project.org/web/packages/sem/index.html

#+BEGIN_SRC R :exports both :results output :session *R*
  library('sem')
  modela <- specifyModel(covs=c("x","y2,y3"),
                             text="
  e -> y1,  NA,   1
  e -> y2,  lam2, NA
  e -> y3,  lam3, NA
  x -> e,   b,   NA
  ")
  summary(sem::sem(modela,data=d))
#+END_SRC

#+RESULTS:
#+begin_example
 Read 4 records
NOTE: it is generally simpler to use specifyEquations() or cfa()
      see ?specifyEquations
NOTE: adding 2 variances to the model

 Model Chisquare =  0.2621384   Df =  1 Pr(>Chisq) = 0.6086549
 AIC =  18.26214
 BIC =  -5.036179

 Normalized Residuals
      Min.    1st Qu.     Median       Mean    3rd Qu.       Max. 
-1.035e-01 -1.129e-02  2.500e-07 -9.774e-05  1.145e-02  1.021e-01 

 R-square for Endogenous Variables
     e     y1     y2     y3 
0.5094 0.7263 0.7341 0.7305 

 Parameter Estimates
         Estimate   Std Error  z value   Pr(>|z|)               
lam2      1.0170782 0.08235911 12.349311 4.913029e-35 y2 <--- e 
lam3      1.0101923 0.08206794 12.309220 8.080078e-35 y3 <--- e 
b         1.0603838 0.09809037 10.810275 3.077463e-27 e <--- x  
V[x]      1.1428136 0.11456813  9.974969 1.961633e-23 x <--> x  
V[y2]     0.9452969 0.19014577  4.971432 6.646004e-07 y2 <--> y2
C[y2,y3] -0.1640403 0.15405894 -1.064789 2.869713e-01 y3 <--> y2
V[y3]     0.9497850 0.18908758  5.022990 5.087322e-07 y3 <--> y3
V[e]      1.2374661 0.18295047  6.763941 1.342882e-11 e <--> e  
V[y1]     0.9507045 0.16481660  5.768257 8.009548e-09 y1 <--> y1

 Iterations =  22
#+end_example

** COMMENT Session Information

#+BEGIN_SRC R :exports both :results output :session *R* 
sessionInfo()
#+END_SRC

#+RESULTS:
#+begin_example
R version 3.3.1 (2016-06-21)
Platform: x86_64-redhat-linux-gnu (64-bit)
Running under: Fedora 24 (Workstation Edition)

locale:
 [1] LC_CTYPE=en_US.UTF-8       LC_NUMERIC=C              
 [3] LC_TIME=en_US.UTF-8        LC_COLLATE=en_US.UTF-8    
 [5] LC_MONETARY=en_US.UTF-8    LC_MESSAGES=en_US.UTF-8   
 [7] LC_PAPER=en_US.UTF-8       LC_NAME=C                 
 [9] LC_ADDRESS=C               LC_TELEPHONE=C            
[11] LC_MEASUREMENT=en_US.UTF-8 LC_IDENTIFICATION=C       

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
[1] mplus_1.0              microbenchmark_1.4-2.1 sem_3.1-8             
[4] lavaan_0.5-20          lava_1.4.4            

loaded via a namespace (and not attached):
 [1] Rcpp_0.12.6         compiler_3.3.1      nloptr_1.0.4       
 [4] influenceR_0.1.0    plyr_1.8.4          tools_3.3.1        
 [7] boot_1.3-18         lme4_1.1-12         digest_0.6.10      
[10] gtable_0.2.0        jsonlite_1.0        nlme_3.1-128       
[13] lattice_0.20-33     Matrix_1.2-6        graph_1.44.1       
[16] igraph_1.0.1        rstudioapi_0.6      Rgraphviz_2.10.0   
[19] yaml_2.1.13         parallel_3.3.1      mvtnorm_1.0-5      
[22] pbivnorm_0.6.0      coda_0.18-1         DiagrammeR_0.8.4   
[25] stringr_1.0.0       htmlwidgets_0.7     stats4_3.3.1       
[28] grid_3.3.1          mi_1.0              survival_2.39-5    
[31] arm_1.8-6           multcomp_1.4-6      TH.data_1.0-7      
[34] minqa_1.2.4         ggplot2_2.1.0       magrittr_1.5       
[37] codetools_0.2-14    scales_0.4.0        htmltools_0.3.5    
[40] matrixcalc_1.0-3    MASS_7.3-45         splines_3.3.1      
[43] BiocGenerics_0.12.1 abind_1.4-5         mnormt_1.5-4       
[46] colorspace_1.2-6    quadprog_1.5-5      sandwich_2.3-4     
[49] stringi_1.1.1       visNetwork_1.0.1    munsell_0.4.3      
[52] zoo_1.7-13
#+end_example

* Stata 

- http://www.stata.com/manuals13/sem.pdf (since version 13, =gsem= version 14)

#+BEGIN_SRC stata :session *stata* :exports both
insheet using "data.tab", clear
sem (y1 y2 y3 <- U) (U <- x), cov(e.y2*e.y3)
#+END_SRC

#+RESULTS:
#+begin_example
(4 vars, 200 obs)

Endogenous variables

Measurement:  y1 y2 y3
Latent:       U

Exogenous variables

Observed:     x

Fitting target model:

Iteration 0:   log likelihood = -1299.5308  
Iteration 1:   log likelihood = -1298.9631  
Iteration 2:   log likelihood = -1298.9498  
Iteration 3:   log likelihood = -1298.9498  

Structural equation model                       Number of obs      =       200
Estimation method  = ml
Log likelihood     = -1298.9498

 ( 1)  [y1]U = 1
------------------------------------------------------------------------------
             |                 OIM
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
Structural   |
  U <-       |
           x |   1.060384   .0978448    10.84   0.000     .8686115    1.252156
-------------+----------------------------------------------------------------
Measurement  |
  y1 <-      |
           U |          1  (constrained)
       _cons |  -.0645497    .104339    -0.62   0.536    -.2690504     .139951
  -----------+----------------------------------------------------------------
  y2 <-      |
           U |   1.017078   .0825774    12.32   0.000     .8552297    1.178927
       _cons |  -.0595797   .1052225    -0.57   0.571     -.265812    .1466525
  -----------+----------------------------------------------------------------
  y3 <-      |
           U |   1.010192   .0814747    12.40   0.000     .8505049     1.16988
       _cons |  -.1419926   .1049197    -1.35   0.176    -.3476314    .0636463
-------------+----------------------------------------------------------------
    var(e.y1)|   .9459512   .1636727                      .6738916    1.327845
    var(e.y2)|     .94057   .1901889                      .6328095    1.398007
    var(e.y3)|   .9450358   .1863511                      .6420965    1.390901
     var(e.U)|   1.231279   .1816616                      .9220848    1.644151
-------------+----------------------------------------------------------------
    cov(e.y2,|
        e.y3)|  -.1632204   .1529111    -1.07   0.286    -.4629207    .1364798
------------------------------------------------------------------------------
LR test of model vs. saturated: chi2(1)   =      0.26, Prob > chi2 = 0.6078
#+end_example

